program RandomArray;
uses crt;

var
  A: array[1..10, 1..10] of integer;  // Оголошення масиву розміру 10x10
  n, i, j: integer;  // Оголошення змінних для розміру масиву та індексів
  randomValue: integer;  // Змінна для збереження випадкового числа

begin
  clrscr;

  writeln('Введіть розмірність масиву n (макс. 10): ');
  readln(n);

  { Ініціалізація генератора випадкових чисел }
  randomize;  // Ініціалізація генератора випадкових чисел для отримання різних результатів на кожному запуску

  { Заповнення масиву випадковими числами в діапазоні від -200 до 200 }
  for i := 1 to n do
    for j := 1 to n do
    begin
      randomValue := random(401) - 200;  // random(401) генерує числа від 0 до 400, віднімаємо 200, щоб отримати діапазон від -200 до 200
      A[i, j] := randomValue;  // Запис випадкового числа в масив
      write('A[', i, ',', j, ']: ', A[i, j], '  ');  // Виведення елементу масиву
    end;

  writeln;
  readln;
end.
